hypr/hyprland.org
:DOC-CONFIG:
#+PROPERTY: header-args:conf :tangle hyprland.conf :comments link
#+auto_tangle: t
:END:

#+TITLE: hyprland config
#+AUTHOR: Dak

This is my hyprland config

* Main
** Source
 Sourcing external config files
 #+begin_src example
# [[file:hyprland.org::*Input][Input:1]]
# Input:1 ends here
#+end_src

* Startup Apps
Commands & Apps that will be executed when hyprland starts

** First to be run

#+begin_src conf
$scriptsDir = $HOME/.config/hypr/scripts
$UserScripts = $HOME/.config/hypr/UserScripts

$wallDIR=$HOME/Pictures/wallpapers
$lock = $scriptsDir/LockScreen.sh
$SwwwRandom = $UserScripts/WallpaperAutoChange.sh
#+end_src

** wallpaper stuff / More wallpaper options below

#+begin_src conf
exec-once = swww-daemon --format xrgb
#+end_src

for random wallpaper switcher every 30 minutes add this line to above src block:
exec-once = $SwwwRandom $wallDIR

** Startup

#+begin_src conf
exec-once = dbus-update-activation-environment --systemd WAYLAND_DISPLAY XDG_CURRENT_DESKTOP
exec-once = systemctl --user import-environment WAYLAND_DISPLAY XDG_CURRENT_DESKTOP
#+end_src

** Polkit (Polkit Gnome / KDE)

#+begin_src conf
exec-once = $scriptsDir/Polkit.sh
#+end_src

** startup apps

#+begin_src conf

exec-once = waybar &
exec-once = nm-applet --indicator &
exec-once = swaync &
exec-once = ags &
#exec-once = blueman-applet &
#exec-once = rog-control-center &
#+end_src

** clipboard manager

#+begin_src conf
exec-once = wl-paste --type text --watch cliphist store
exec-once = wl-paste --type image --watch cliphist store
#+end_src

** Starting hypridle to start hyprlock

#+begin_src conf
exec-once = hypridle &
#+end_src

** Start pyprland daemon
#+begin_src conf
exec-once = pypr &
#+end_src

** Here are list of features available but disabled by default

Add any to a src block to use

exec-once = swww-daemon --format xrgb && swww img $HOME/Pictures/wallpapers/mecha-nostalgia.png  # persistent wallpaper

gnome polkit for nixos
exec-once = $scriptsDir/Polkit-NixOS.sh

xdg-desktop-portal-hyprland (should be auto starting. However, you can force to start)
exec-once = $scriptsDir/PortalHyprland.sh

* Settings

Default Settings. avoid changing this file as during update, this will be replaced
refer to Hyprland wiki for more info https://wiki.hyprland.org/Configuring/Variables
Initial boot script enable to apply initial wallpapers, theming, new settings etc

#+begin_src conf
exec-once = $HOME/.config/hypr/initial-boot.sh
#+end_src


* Keybinds
Main Keybinds

#+begin_src conf
$mainMod = SUPER
#+end_src

** Default

#+begin_src conf
$scriptsDir = $HOME/.config/hypr/scripts
$configs = $HOME/.config/hypr/configs
#+end_src

** User

#+begin_src conf
$UserConfigs = $HOME/.config/hypr/UserConfigs
$UserScripts = $HOME/.config/hypr/UserScripts

bind = CTRL ALT, Delete, exec, hyprctl dispatch exit 0
bind = $mainMod, Q, killactive,
bind = $mainMod, F, fullscreen
bind = $mainMod SHIFT, Q, exec, $scriptsDir/KillActiveProcess.sh
bind = $mainMod SHIFT, F, togglefloating,
bind = $mainMod ALT, F, exec, hyprctl dispatch workspaceopt allfloat
bind = CTRL ALT, L, exec, $scriptsDir/LockScreen.sh
bind = CTRL ALT, P, exec, $scriptsDir/Wlogout.sh
#+end_src

** FEATURES / EXTRAS

#+begin_src conf
bind = $mainMod, H, exec, $scriptsDir/KeyHints.sh # Small help file
bind = $mainMod ALT, R, exec, $scriptsDir/Refresh.sh # Refresh waybar, swaync, rofi
bind = $mainMod ALT, E, exec, $scriptsDir/RofiEmoji.sh # emoji
#bind = $mainMod, S, exec, $scriptsDir/RofiSearch.sh # Google search from Rofi
bind = $mainMod SHIFT, B, exec, $scriptsDir/ChangeBlur.sh # Toggle blur settings
bind = $mainMod SHIFT, G, exec, $scriptsDir/GameMode.sh # animations ON/OFF
bind = $mainMod ALT, L, exec, $scriptsDir/ChangeLayout.sh # Toggle Master or Dwindle Layout
bind = $mainMod ALT, V, exec, $scriptsDir/ClipManager.sh # Clipboard Manager
bind = $mainMod SHIFT, N, exec, swaync-client -t -sw # swayNC panel
#+end_src

** FEATURES / EXTRAS (UserScripts)

#+begin_src conf
bind = $mainMod, L, exec, $UserScripts/QuickEdit.sh # Quick Edit Hyprland Settings
bind = $mainMod SHIFT, M, exec, $UserScripts/RofiBeats.sh # online music
bind = $mainMod, W, exec, $UserScripts/WallpaperSelect.sh # Select wallpaper to apply
bind = $mainMod SHIFT, W, exec, $UserScripts/WallpaperEffects.sh # Wallpaper Effects by imagemagickWW
bind = CTRL ALT, W, exec, $UserScripts/WallpaperRandom.sh # Random wallpapers
bind = $mainMod ALT, O, exec, hyprctl setprop active opaque toggle #disable opacity to active window
bind = $mainMod SHIFT, K, exec, $scriptsDir/KeyBinds.sh # searchable keybinds
# Waybar / Bar related
bind = $mainMod, B, exec, pkill -SIGUSR1 waybar # Toggle hide/show waybar
#+end_src

** Dwindle Layout

#+begin_src conf
bind = $mainMod SHIFT, I, togglesplit # only works on dwindle layout
bind = $mainMod, P, pseudo, # dwindle
#+end_src

** Master Layout

#+begin_src conf
bind = $mainMod CTRL, D, layoutmsg, removemaster
bind = $mainMod, U, layoutmsg, addmaster
bind = $mainMod, J, layoutmsg, cyclenext
bind = $mainMod, K, layoutmsg, cycleprev
bind = $mainMod CTRL, Return, layoutmsg, swapwithmaster
#+end_src

** Works on either layout (Master or Dwindle)

#+begin_src conf
bind = $mainMod, M, exec, hyprctl dispatch splitratio 0.3
#+end_src

** group

#+begin_src conf
bind = $mainMod, G, togglegroup
bind = $mainMod CTRL, tab, changegroupactive  #change focus to another window
#+end_src

** Cycle windows if floating bring to top

#+begin_src conf
bind = ALT, tab, cyclenext
bind = ALT, tab, bringactivetotop
#+end_src

** Special Keys / Hot Keys

#+begin_src conf
bindel = , xf86audioraisevolume, exec, $scriptsDir/Volume.sh --inc #volume up
bindel = , xf86audiolowervolume, exec, $scriptsDir/Volume.sh --dec #volume down
bindl = , xf86AudioMicMute, exec, $scriptsDir/Volume.sh --toggle-mic #mute mic
bindl = , xf86audiomute, exec, $scriptsDir/Volume.sh --toggle
bindl = , xf86Sleep, exec, systemctl suspend  # sleep button
bindl = , xf86Rfkill, exec, $scriptsDir/AirplaneMode.sh #Airplane mode

#+end_src
** media controls using keyboards

#+begin_src conf
bindl = , xf86AudioPlayPause, exec, $scriptsDir/MediaCtrl.sh --pause
bindl = , xf86AudioPause, exec, $scriptsDir/MediaCtrl.sh --pause
bindl = , xf86AudioPlay, exec, $scriptsDir/MediaCtrl.sh --pause
bindl = , xf86AudioNext, exec, $scriptsDir/MediaCtrl.sh --nxt
bindl = , xf86AudioPrev, exec, $scriptsDir/MediaCtrl.sh --prv
bindl = , xf86audiostop, exec, $scriptsDir/MediaCtrl.sh --stop
#+end_src

** Screenshot keybindings NOTE: You may need to press Fn key as well

#+begin_src conf
bind = $mainMod, Print, exec, $scriptsDir/ScreenShot.sh --now
bind = $mainMod SHIFT, Print, exec, $scriptsDir/ScreenShot.sh --area
bind = $mainMod CTRL, Print, exec, $scriptsDir/ScreenShot.sh --in5 #screenshot in 5 secs
bind = $mainMod CTRL SHIFT, Print, exec, $scriptsDir/ScreenShot.sh --in10 #screenshot in 10 secs
bind = ALT, Print, exec, $scriptsDir/ScreenShot.sh --active #take screenshot of active window
#+end_src

** screenshot with swappy (another screenshot tool)

#+begin_src conf
bind = $mainMod SHIFT, S, exec, $scriptsDir/ScreenShot.sh --swappy
#+end_src

** Resize windows

#+begin_src conf
binde = $mainMod SHIFT, left, resizeactive,-50 0
binde = $mainMod SHIFT, right, resizeactive,50 0
binde = $mainMod SHIFT, up, resizeactive,0 -50
binde = $mainMod SHIFT, down, resizeactive,0 50
#+end_src

** Move windows

#+begin_src conf
bind = $mainMod CTRL, left, movewindow, l
bind = $mainMod CTRL, right, movewindow, r
bind = $mainMod CTRL, up, movewindow, u
bind = $mainMod CTRL, down, movewindow, d
#+end_src

** Move focus with mainMod + arrow keys

#+begin_src conf
bind = $mainMod, left, movefocus, l
bind = $mainMod, right, movefocus, r
bind = $mainMod, up, movefocus, u
bind = $mainMod, down, movefocus, d
#+end_src

