hypr/hyprland.conf
# [[file:hyprland.org::*First to be run][First to be run:1]]
$scriptsDir = $HOME/.config/hypr/scripts
$UserScripts = $HOME/.config/hypr/UserScripts

$wallDIR=$HOME/Pictures/wallpapers
$lock = $scriptsDir/LockScreen.sh
$SwwwRandom = $UserScripts/WallpaperAutoChange.sh
# First to be run:1 ends here

# [[file:hyprland.org::*wallpaper stuff / More wallpaper options below][wallpaper stuff / More wallpaper options below:1]]
exec-once = swww-daemon --format xrgb
# wallpaper stuff / More wallpaper options below:1 ends here

# [[file:hyprland.org::*Startup][Startup:1]]
exec-once = dbus-update-activation-environment --systemd WAYLAND_DISPLAY XDG_CURRENT_DESKTOP
exec-once = systemctl --user import-environment WAYLAND_DISPLAY XDG_CURRENT_DESKTOP
# Startup:1 ends here

# [[file:hyprland.org::*Polkit (Polkit Gnome / KDE)][Polkit (Polkit Gnome / KDE):1]]
exec-once = $scriptsDir/Polkit.sh
# Polkit (Polkit Gnome / KDE):1 ends here

# [[file:hyprland.org::*startup apps][startup apps:1]]
exec-once = waybar &
exec-once = nm-applet --indicator &
exec-once = swaync &
exec-once = ags &
#exec-once = blueman-applet &
#exec-once = rog-control-center &
# startup apps:1 ends here

# [[file:hyprland.org::*clipboard manager][clipboard manager:1]]
exec-once = wl-paste --type text --watch cliphist store
exec-once = wl-paste --type image --watch cliphist store
# clipboard manager:1 ends here

# [[file:hyprland.org::*Starting hypridle to start hyprlock][Starting hypridle to start hyprlock:1]]
exec-once = hypridle &
# Starting hypridle to start hyprlock:1 ends here

# [[file:hyprland.org::*Start pyprland daemon][Start pyprland daemon:1]]
exec-once = pypr &
# Start pyprland daemon:1 ends here

# [[file:hyprland.org::*Settings][Settings:1]]
exec-once = $HOME/.config/hypr/initial-boot.sh
# Settings:1 ends here

# [[file:hyprland.org::*Keybinds][Keybinds:1]]
$mainMod = SUPER
# Keybinds:1 ends here

# [[file:hyprland.org::*Default][Default:1]]
$scriptsDir = $HOME/.config/hypr/scripts
$configs = $HOME/.config/hypr/configs
# Default:1 ends here

# [[file:hyprland.org::*User][User:1]]
$UserConfigs = $HOME/.config/hypr/UserConfigs
$UserScripts = $HOME/.config/hypr/UserScripts

bind = CTRL ALT, Delete, exec, hyprctl dispatch exit 0
bind = $mainMod, Q, killactive,
bind = $mainMod, F, fullscreen
bind = $mainMod SHIFT, Q, exec, $scriptsDir/KillActiveProcess.sh
bind = $mainMod SHIFT, F, togglefloating,
bind = $mainMod ALT, F, exec, hyprctl dispatch workspaceopt allfloat
bind = CTRL ALT, L, exec, $scriptsDir/LockScreen.sh
bind = CTRL ALT, P, exec, $scriptsDir/Wlogout.sh
# User:1 ends here

# [[file:hyprland.org::*FEATURES / EXTRAS][FEATURES / EXTRAS:1]]
bind = $mainMod, H, exec, $scriptsDir/KeyHints.sh # Small help file
bind = $mainMod ALT, R, exec, $scriptsDir/Refresh.sh # Refresh waybar, swaync, rofi
bind = $mainMod ALT, E, exec, $scriptsDir/RofiEmoji.sh # emoji
#bind = $mainMod, S, exec, $scriptsDir/RofiSearch.sh # Google search from Rofi
bind = $mainMod SHIFT, B, exec, $scriptsDir/ChangeBlur.sh # Toggle blur settings
bind = $mainMod SHIFT, G, exec, $scriptsDir/GameMode.sh # animations ON/OFF
bind = $mainMod ALT, L, exec, $scriptsDir/ChangeLayout.sh # Toggle Master or Dwindle Layout
bind = $mainMod ALT, V, exec, $scriptsDir/ClipManager.sh # Clipboard Manager
bind = $mainMod SHIFT, N, exec, swaync-client -t -sw # swayNC panel
# FEATURES / EXTRAS:1 ends here

# [[file:hyprland.org::*FEATURES / EXTRAS (UserScripts)][FEATURES / EXTRAS (UserScripts):1]]
bind = $mainMod, L, exec, $UserScripts/QuickEdit.sh # Quick Edit Hyprland Settings
bind = $mainMod SHIFT, M, exec, $UserScripts/RofiBeats.sh # online music
bind = $mainMod, W, exec, $UserScripts/WallpaperSelect.sh # Select wallpaper to apply
bind = $mainMod SHIFT, W, exec, $UserScripts/WallpaperEffects.sh # Wallpaper Effects by imagemagickWW
bind = CTRL ALT, W, exec, $UserScripts/WallpaperRandom.sh # Random wallpapers
bind = $mainMod ALT, O, exec, hyprctl setprop active opaque toggle #disable opacity to active window
bind = $mainMod SHIFT, K, exec, $scriptsDir/KeyBinds.sh # searchable keybinds
# Waybar / Bar related
bind = $mainMod, B, exec, pkill -SIGUSR1 waybar # Toggle hide/show waybar
# FEATURES / EXTRAS (UserScripts):1 ends here

# [[file:hyprland.org::*Dwindle Layout][Dwindle Layout:1]]
bind = $mainMod SHIFT, I, togglesplit # only works on dwindle layout
bind = $mainMod, P, pseudo, # dwindle
# Dwindle Layout:1 ends here

# [[file:hyprland.org::*Master Layout][Master Layout:1]]
bind = $mainMod CTRL, D, layoutmsg, removemaster
bind = $mainMod, U, layoutmsg, addmaster
bind = $mainMod, J, layoutmsg, cyclenext
bind = $mainMod, K, layoutmsg, cycleprev
bind = $mainMod CTRL, Return, layoutmsg, swapwithmaster
# Master Layout:1 ends here

# [[file:hyprland.org::*Works on either layout (Master or Dwindle)][Works on either layout (Master or Dwindle):1]]
bind = $mainMod, M, exec, hyprctl dispatch splitratio 0.3
# Works on either layout (Master or Dwindle):1 ends here

# [[file:hyprland.org::*group][group:1]]
bind = $mainMod, G, togglegroup
bind = $mainMod CTRL, tab, changegroupactive  #change focus to another window
# group:1 ends here

# [[file:hyprland.org::*Cycle windows if floating bring to top][Cycle windows if floating bring to top:1]]
bind = ALT, tab, cyclenext
bind = ALT, tab, bringactivetotop
# Cycle windows if floating bring to top:1 ends here

# [[file:hyprland.org::*Special Keys / Hot Keys][Special Keys / Hot Keys:1]]
bindel = , xf86audioraisevolume, exec, $scriptsDir/Volume.sh --inc #volume up
bindel = , xf86audiolowervolume, exec, $scriptsDir/Volume.sh --dec #volume down
bindl = , xf86AudioMicMute, exec, $scriptsDir/Volume.sh --toggle-mic #mute mic
bindl = , xf86audiomute, exec, $scriptsDir/Volume.sh --toggle
bindl = , xf86Sleep, exec, systemctl suspend  # sleep button
bindl = , xf86Rfkill, exec, $scriptsDir/AirplaneMode.sh #Airplane mode
# Special Keys / Hot Keys:1 ends here

# [[file:hyprland.org::*media controls using keyboards][media controls using keyboards:1]]
bindl = , xf86AudioPlayPause, exec, $scriptsDir/MediaCtrl.sh --pause
bindl = , xf86AudioPause, exec, $scriptsDir/MediaCtrl.sh --pause
bindl = , xf86AudioPlay, exec, $scriptsDir/MediaCtrl.sh --pause
bindl = , xf86AudioNext, exec, $scriptsDir/MediaCtrl.sh --nxt
bindl = , xf86AudioPrev, exec, $scriptsDir/MediaCtrl.sh --prv
bindl = , xf86audiostop, exec, $scriptsDir/MediaCtrl.sh --stop
# media controls using keyboards:1 ends here

# [[file:hyprland.org::*Screenshot keybindings NOTE: You may need to press Fn key as well][Screenshot keybindings NOTE: You may need to press Fn key as well:1]]
bind = $mainMod, Print, exec, $scriptsDir/ScreenShot.sh --now
bind = $mainMod SHIFT, Print, exec, $scriptsDir/ScreenShot.sh --area
bind = $mainMod CTRL, Print, exec, $scriptsDir/ScreenShot.sh --in5 #screenshot in 5 secs
bind = $mainMod CTRL SHIFT, Print, exec, $scriptsDir/ScreenShot.sh --in10 #screenshot in 10 secs
bind = ALT, Print, exec, $scriptsDir/ScreenShot.sh --active #take screenshot of active window
# Screenshot keybindings NOTE: You may need to press Fn key as well:1 ends here

# [[file:hyprland.org::*screenshot with swappy (another screenshot tool)][screenshot with swappy (another screenshot tool):1]]
bind = $mainMod SHIFT, S, exec, $scriptsDir/ScreenShot.sh --swappy
# screenshot with swappy (another screenshot tool):1 ends here

# [[file:hyprland.org::*Resize windows][Resize windows:1]]
binde = $mainMod SHIFT, left, resizeactive,-50 0
binde = $mainMod SHIFT, right, resizeactive,50 0
binde = $mainMod SHIFT, up, resizeactive,0 -50
binde = $mainMod SHIFT, down, resizeactive,0 50
# Resize windows:1 ends here

# [[file:hyprland.org::*Move windows][Move windows:1]]
bind = $mainMod CTRL, left, movewindow, l
bind = $mainMod CTRL, right, movewindow, r
bind = $mainMod CTRL, up, movewindow, u
bind = $mainMod CTRL, down, movewindow, d
# Move windows:1 ends here

# [[file:hyprland.org::*Move focus with mainMod + arrow keys][Move focus with mainMod + arrow keys:1]]
bind = $mainMod, left, movefocus, l
bind = $mainMod, right, movefocus, r
bind = $mainMod, up, movefocus, u
bind = $mainMod, down, movefocus, d
# Move focus with mainMod + arrow keys:1 ends here
