hypr/hyprland.conf

# [[file:hyprland.org::*Workspaces related][Workspaces related:1]]
bind = $mainMod, tab, workspace, m+1
bind = $mainMod SHIFT, tab, workspace, m-1
# Workspaces related:1 ends here

# [[file:hyprland.org::*Special workspace][Special workspace:1]]
bind = $mainMod SHIFT, U, movetoworkspace, special
bind = $mainMod, U, togglespecialworkspace,
# Special workspace:1 ends here

# [[file:hyprland.org::*The following mappings use the key codes to better support various keyboard layouts][The following mappings use the key codes to better support various keyboard layouts:1]]
bind = $mainMod, code:10, workspace, 1
bind = $mainMod, code:11, workspace, 2
bind = $mainMod, code:12, workspace, 3
bind = $mainMod, code:13, workspace, 4
bind = $mainMod, code:14, workspace, 5
bind = $mainMod, code:15, workspace, 6
bind = $mainMod, code:16, workspace, 7
bind = $mainMod, code:17, workspace, 8
bind = $mainMod, code:18, workspace, 9
bind = $mainMod, code:19, workspace, 10
# The following mappings use the key codes to better support various keyboard layouts:1 ends here

# [[file:hyprland.org::*Move active window and follow to workspace mainMod + SHIFT \[0-9\]][Move active window and follow to workspace mainMod + SHIFT [0-9]:1]]
bind = $mainMod SHIFT, code:10, movetoworkspace, 1
bind = $mainMod SHIFT, code:11, movetoworkspace, 2
bind = $mainMod SHIFT, code:12, movetoworkspace, 3
bind = $mainMod SHIFT, code:13, movetoworkspace, 4
bind = $mainMod SHIFT, code:14, movetoworkspace, 5
bind = $mainMod SHIFT, code:15, movetoworkspace, 6
bind = $mainMod SHIFT, code:16, movetoworkspace, 7
bind = $mainMod SHIFT, code:17, movetoworkspace, 8
bind = $mainMod SHIFT, code:18, movetoworkspace, 9
bind = $mainMod SHIFT, code:19, movetoworkspace, 10
bind = $mainMod SHIFT, bracketleft, movetoworkspace, -1 # brackets [ or ]
bind = $mainMod SHIFT, bracketright, movetoworkspace, +1
# Move active window and follow to workspace mainMod + SHIFT [0-9]:1 ends here

# [[file:hyprland.org::*Move active window to a workspace silently mainMod + CTRL \[0-9\]][Move active window to a workspace silently mainMod + CTRL [0-9]:1]]
bind = $mainMod CTRL, code:10, movetoworkspacesilent, 1
bind = $mainMod CTRL, code:11, movetoworkspacesilent, 2
bind = $mainMod CTRL, code:12, movetoworkspacesilent, 3
bind = $mainMod CTRL, code:13, movetoworkspacesilent, 4
bind = $mainMod CTRL, code:14, movetoworkspacesilent, 5
bind = $mainMod CTRL, code:15, movetoworkspacesilent, 6
bind = $mainMod CTRL, code:16, movetoworkspacesilent, 7
bind = $mainMod CTRL, code:17, movetoworkspacesilent, 8
bind = $mainMod CTRL, code:18, movetoworkspacesilent, 9
bind = $mainMod CTRL, code:19, movetoworkspacesilent, 10
bind = $mainMod CTRL, bracketleft, movetoworkspacesilent, -1 # brackets [ or ]
bind = $mainMod CTRL, bracketright, movetoworkspacesilent, +1
# Move active window to a workspace silently mainMod + CTRL [0-9]:1 ends here

# [[file:hyprland.org::*Scroll through existing workspaces with mainMod + scroll][Scroll through existing workspaces with mainMod + scroll:1]]
bind = $mainMod, mouse_down, workspace, e+1
bind = $mainMod, mouse_up, workspace, e-1
bind = $mainMod, period, workspace, e+1
bind = $mainMod, comma, workspace, e-1
# Scroll through existing workspaces with mainMod + scroll:1 ends here

# [[file:hyprland.org::*Move/resize windows with mainMod + LMB/RMB and dragging][Move/resize windows with mainMod + LMB/RMB and dragging:1]]
bindm = $mainMod, mouse:272, movewindow
bindm = $mainMod, mouse:273, resizewindow
# Move/resize windows with mainMod + LMB/RMB and dragging:1 ends here

# [[file:hyprland.org::*Environment Variables][Environment Variables:1]]
env = EDITOR,emacs #default editor
# Environment Variables:1 ends here

# [[file:hyprland.org::*Environment Variables][Environment Variables:2]]
env = CLUTTER_BACKEND,wayland
env = GDK_BACKEND,wayland,x11
env = QT_AUTO_SCREEN_SCALE_FACTOR,1
env = QT_QPA_PLATFORM,wayland;xcb
env = QT_QPA_PLATFORMTHEME,qt5ct
env = QT_QPA_PLATFORMTHEME,qt6ct
env = QT_SCALE_FACTOR,1
env = QT_WAYLAND_DISABLE_WINDOWDECORATION,1
env = XDG_CURRENT_DESKTOP,Hyprland
env = XDG_SESSION_DESKTOP,Hyprland
env = XDG_SESSION_TYPE,wayland
# Environment Variables:2 ends here

# [[file:hyprland.org::*xwayland apps scale fix][xwayland apps scale fix:1]]
env = GDK_SCALE,1
# xwayland apps scale fix:1 ends here

# [[file:hyprland.org::*xwayland apps scale fix][xwayland apps scale fix:2]]
env = MOZ_ENABLE_WAYLAND,1
# xwayland apps scale fix:2 ends here

# [[file:hyprland.org::*xwayland apps scale fix][xwayland apps scale fix:3]]
env = ELECTRON_OZONE_PLATFORM_HINT,auto
# xwayland apps scale fix:3 ends here

# [[file:hyprland.org::*Laptops][Laptops:1]]
$mainMod = SUPER
$scriptsDir = $HOME/.config/hypr/scripts
$UserConfigs = $HOME/.config/hypr/UserConfigs
# Laptops:1 ends here

# [[file:hyprland.org::*Touchpad][Touchpad:1]]
$Touchpad_Device=asue1209:00-04f3:319f-touchpad

$TOUCHPAD_ENABLED = true
device {
  name = $Touchpad_Device
  enabled = $TOUCHPAD_ENABLED
}
# Touchpad:1 ends here

# [[file:hyprland.org::*Bind][Bind:1]]
binde = , xf86KbdBrightnessDown, exec, $scriptsDir/BrightnessKbd.sh --dec #Keyboard brightness Down
binde = , xf86KbdBrightnessUp, exec, $scriptsDir/BrightnessKbd.sh --inc #Keyboard brightness up
bind = , xf86Launch1, exec, rog-control-center # ASUS Armory crate button
bind = , xf86Launch3, exec, asusctl led-mode -n #FN+F4 Switch keyboard RGB profile
bind = , xf86Launch4, exec, asusctl profile -n  #FN+F5 change of fan profiles (Quite, Balance, Performance)
binde = , xf86MonBrightnessDown, exec, $scriptsDir/Brightness.sh --dec
binde = , xf86MonBrightnessUp, exec, $scriptsDir/Brightness.sh --inc
bind = , xf86TouchpadToggle, exec, $scriptsDir/TouchPad.sh #disable touchpad

# Screenshot keybindings for Asus G15 (no PrinSrc button)
bind = $mainMod, F6, exec, $scriptsDir/ScreenShot.sh --now # Fullscreen
bind = $mainMod SHIFT, F6, exec, $scriptsDir/ScreenShot.sh --area
bind = $mainMod CTRL, F6, exec, $scriptsDir/ScreenShot.sh --in5 # Screenshot in 5 secs
bind = $mainMod ALT, F6, exec, $scriptsDir/ScreenShot.sh --in10 # Screenshot in 10 secs
bind = ALT, F6, exec, $scriptsDir/ScreenShot.sh --active # Screenshot active window
# Bind:1 ends here

# [[file:hyprland.org::*Monitor 1][Monitor 1:1]]
# Monitors
monitor=,preferred,auto,1
