hypr/hyprland.conf

# [[file:hyprland.org::*Sourcing colors generated by wallust][Sourcing colors generated by wallust:1]]
source = $HOME/.config/hypr/wallust/wallust-hyprland.conf
# Sourcing colors generated by wallust:1 ends here

# [[file:hyprland.org::*Decoration][Decoration:1]]
decoration {
  rounding = 10

  active_opacity = 1.0
  inactive_opacity = 0.9
  fullscreen_opacity = 1.0

  dim_inactive = true
  dim_strength = 0.1
  dim_special = 0.8

  drop_shadow = true
  shadow_range = 6
  shadow_render_power = 1

  col.shadow = $foreground
  col.shadow_inactive = 0x50000000

  blur {
    enabled = true
    size = 6
    passes = 2
    ignore_opacity = true
    new_optimizations = true
    special = true
  }
}
# Decoration:1 ends here

# [[file:hyprland.org::*Animations][Animations:1]]
animations {
  enabled = yes

  bezier = wind, 0.05, 0.9, 0.1, 1.05
  bezier = winIn, 0.1, 1.1, 0.1, 1.1
  bezier = winOut, 0.3, -0.3, 0, 1
  bezier = liner, 1, 1, 1, 1
  bezier = overshot, 0.05, 0.9, 0.1, 1.05
  bezier = smoothOut, 0.5, 0, 0.99, 0.99
  bezier = smoothIn, 0.5, -0.5, 0.68, 1.5

  animation = windows, 1, 6, wind, slide
  animation = windowsIn, 1, 5, winIn, slide
  animation = windowsOut, 1, 3, smoothOut, slide
  animation = windowsMove, 1, 5, wind, slide
  animation = border, 1, 1, liner
  animation = fade, 1, 3, smoothOut
  animation = workspaces, 1, 5, overshot

  # animations for -git or version >0.42.0
  animation = workspacesIn, 1, 5, winIn, slide
  animation = workspacesOut, 1, 5, winOut, slide
}
# Animations:1 ends here

# [[file:hyprland.org::*Main user keybinds][Main user keybinds:1]]
$mainMod = SUPER
$files = thunar
$term = kitty
$scriptsDir = $HOME/.config/hypr/scripts
$UserScripts = $HOME/.config/hypr/UserScripts
# Main user keybinds:1 ends here

# [[file:hyprland.org::*rofi App launcher][rofi App launcher:1]]
#bindr = $mainMod, $mainMod_L, exec, pkill rofi || rofi -show drun -modi drun,filebrowser,run,window # Super Key to Launch rofi menu
bind = $mainMod, R, exec, pkill rofi || rofi -show drun -modi drun,filebrowser,run,window
bind = $mainMod, A, exec, pkill rofi || true && ags -t 'overview'
# rofi App launcher:1 ends here

# [[file:hyprland.org::*terminal, file manager, browser keys][terminal, file manager, browser keys:1]]
bind = $mainMod, Return, exec, $term  # Launch terminal
bind = $mainMod, E, exec, $files # Launch file

bind = $mainMod, I, exec, firefox # Launch Firefox
bind = $mainMod, S, exec, subl # Launch sublime change later to emacs



bind = $mainMod ALT, C, exec, $UserScripts/RofiCalc.sh # calculator (qalculate)
# terminal, file manager, browser keys:1 ends here

# [[file:hyprland.org::*pyprland][pyprland:1]]
bind = $mainMod SHIFT, Return, exec, pypr toggle term # Dropdown terminal
bind = $mainMod, Z, exec, pypr zoom # Toggle Zoom
# pyprland:1 ends here

# [[file:hyprland.org::*Other][Other:1]]
bind = $mainMod SHIFT, O, exec, $UserScripts/ZshChangeTheme.sh # Change oh-my-zsh theme
bindn = ALT_L, SHIFT_L, exec, $scriptsDir/SwitchKeyboardLayout.sh # Changing the keyboard layout
# Other:1 ends here

# [[file:hyprland.org::*Sourcing colors generated by wallust][Sourcing colors generated by wallust:1]]
source = $HOME/.config/hypr/wallust/wallust-hyprland.conf
# Sourcing colors generated by wallust:1 ends here

# [[file:hyprland.org::*Sourcing colors generated by wallust][Sourcing colors generated by wallust:2]]
dwindle {
  pseudotile = yes
  preserve_split = yes
  special_scale_factor = 0.8
}

master {
  new_status = master
  new_on_top = 1
  mfact = 0.5
}

general {
  border_size = 2
  gaps_in = 6
  gaps_out = 8

  resize_on_border = true

  col.active_border = $color0
  col.inactive_border = $backgroundCol

  layout = dwindle
}
# Sourcing colors generated by wallust:2 ends here

# [[file:hyprland.org::*Input][Input:1]]
input {
  kb_layout = us
  kb_variant =
  kb_model =
  kb_options =
  kb_rules =
  repeat_rate = 50
  repeat_delay = 300

  sensitivity = 0 #mouse sensitivity
  numlock_by_default = true
  left_handed = false
  follow_mouse = true
  float_switch_override_focus = false

  touchpad {
    disable_while_typing = true
    natural_scroll = true
    clickfinger_behavior = false
    middle_button_emulation = true
    tap-to-click = true
    drag_lock = false
          }

  # below for devices with touchdevice ie. touchscreen
	touchdevice {
		enabled = true
	}

	# below is for table see link above for proper variables
	tablet {
		transform = 0
		left_handed = 0
	}
}
# Input:1 ends here

# [[file:hyprland.org::*Gestures][Gestures:1]]
gestures {
  workspace_swipe = true
  workspace_swipe_fingers = 3
  workspace_swipe_distance = 500
  workspace_swipe_invert = true
  workspace_swipe_min_speed_to_force = 30
  workspace_swipe_cancel_ratio = 0.5
  workspace_swipe_create_new = true
  workspace_swipe_forever = true
  #workspace_swipe_use_r = true #uncomment if wanted a forever create a new workspace with swipe right
}


group {
  col.border_active = $color1

	groupbar {
		col.active = $color0
  }
}
# Gestures:1 ends here

# [[file:hyprland.org::*Misc][Misc:1]]
misc {
  disable_hyprland_logo = true
  disable_splash_rendering = true
  vfr = true
  #vrr = 0
  mouse_move_enables_dpms = true
  enable_swallow = true
  swallow_regex = ^(kitty)$
  focus_on_activate = false
  #no_direct_scanout = true #for fullscreen games - deprecated
  initial_workspace_tracking = 0
  middle_click_paste = false
}

#opengl {
#  nvidia_anti_flicker = true
#}

binds {
  workspace_back_and_forth = true
  allow_workspace_cycles = true
  pass_mouse_when_bound = false
}

#Could help when scaling and not pixelating
xwayland {
  force_zero_scaling = true
}

# render section for Hyprland >= v0.42.0
render {
  explicit_sync = 2
  explicit_sync_kms = 2
  direct_scanout = false
}

cursor {
  no_hardware_cursors = false
  enable_hyprcursor = true
  warp_on_change_workspace = true
  no_warps = true
}
# Misc:1 ends here
